In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [5]:
#to get similar results throughout
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [8]:
#selecting a column
df['w']

a    0.302665
b   -0.134841
c    0.807706
d   -0.497104
e   -0.116773
Name: w, dtype: float64

In [13]:
#create a new column
df['new'] = df['w']+df['x']
df

          w         x         y         z       new
a  0.302665  1.693723 -1.706086 -1.159119  1.996388
b -0.134841  0.390528  0.166905  0.184502  0.255687
c  0.807706  0.072960  0.638787  0.329646  0.880666
d -0.497104 -0.754070 -0.943406  0.484752 -1.251174
e -0.116773  1.901755  0.238127  1.996652  1.784981

In [14]:
#dropping a column, by default the rpw is selected, to drop a column, mention axis as 1
df.drop('z')

KeyError: "labels ['z'] not contained in axis"

In [16]:
#the column is not dropped from the actual dataframe
df.drop('new',axis = 1)

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [24]:
df

          w         x         y         z       new
a  0.386030  2.084019 -0.376519  0.230336  2.470049
b  0.681209  1.035125 -0.031160  1.939932  1.716334
c -1.005187 -0.741790  0.187125 -0.732845 -1.746977
d -1.382920  1.482495  0.961458 -2.141212  0.099575
e  0.992573  1.192241 -1.046780  1.292765  2.184814

In [28]:
# to drop a column from the original data fram, set the inplace attribute
#df.drop('new',axis = 1,inplace=True)
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [34]:
df.loc['a']

w    0.386030
x    2.084019
y   -0.376519
z    0.230336
Name: a, dtype: float64

In [36]:
df.iloc[4]

w    0.992573
x    1.192241
y   -1.046780
z    1.292765
Name: e, dtype: float64

In [39]:
df.loc[['a','b'],['w','y']]

          w         y
a  0.386030 -0.376519
b  0.681209 -0.031160

# Conditional selections for data frames

In [40]:
booldf = df>0
booldf

       w      x      y      z
a   True   True  False   True
b   True   True  False   True
c  False  False   True  False
d  False   True   True  False
e   True   True  False   True

In [42]:
#df[booldf] is same as
df[df>0]

          w         x         y         z
a  0.386030  2.084019       NaN  0.230336
b  0.681209  1.035125       NaN  1.939932
c       NaN       NaN  0.187125       NaN
d       NaN  1.482495  0.961458       NaN
e  0.992573  1.192241       NaN  1.292765

In [44]:
#get only those rows where a particular condition is satisfied in the given column
df[df['w']<0]

          w         x         y         z
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212

In [46]:
#get the columns where a particular condition is satisfied by a dataframe
#return the entries in column y where the data in column w is greater than 0
df[df['w']>0]['y']

a   -0.376519
b   -0.031160
e   -1.046780
Name: y, dtype: float64

In [47]:
#get multiple columns
df[df['w']>0][['y','x']]

          y         x
a -0.376519  2.084019
b -0.031160  1.035125
e -1.046780  1.192241

In [50]:
#get boolean series ,same as df[df['w']>0][['y','x']]
boolser = df['w']>0
boolser
result = df[boolser]
result

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
e  0.992573  1.192241 -1.046780  1.292765

In [59]:
df

          w         x         y         z
a  0.386030  2.084019 -0.376519  0.230336
b  0.681209  1.035125 -0.031160  1.939932
c -1.005187 -0.741790  0.187125 -0.732845
d -1.382920  1.482495  0.961458 -2.141212
e  0.992573  1.192241 -1.046780  1.292765

In [61]:
df[df['w']+df['y'] > 0]['x']

a    2.084019
b    1.035125
Name: x, dtype: float64

Working with missing data

# group by function

In [62]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [64]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [67]:
bycomp = df.groupby('Company')

In [68]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [71]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464